'''
1分组分解法 2.拆添项法 3.配方法 4.因式定理（公式法）5.换元法 6.主元法 7.特殊值法8.待定系数法 9.双十字相乘法 10.二次多项式 11.提公因式法,12.十字相乘法

一提二套三分四查:提取公因式法、套用公式法、分组分解法和十字相乘法


乘法分配律:
25*401
=25*(400+1)
=25*400+25*1
=10000+25
=10025

完全平方公式:
两数和的平方，等于它们的平方和加上它们的积的2倍。
（a+b）²=a²﹢2ab+b²
两数差的平方，等于它们的平方和减去它们的积的2倍。
﹙a－b﹚²=a²+b²﹣2ab

平方差公式：
(a+b)(a-b)=a²-b²


分组分解法:
2+2分法，3+1分法
2+2分法：
ax+ay+bx+by
=(ax+ay)+(bx+by)
=a(x+y)+b(x+y)
=(a+b)(x+y)

3+1分法：
2xy-x²+1-y²
=-x²+2xy-y²+1
=(x²-2xy+y²)+1
=1-(x-y)²
=(1+x-y)(1-x+y)


十字分解法:
x²+(a+b)x+ab=(x+a)(x+b)
'''

